; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image1 - mode
	thermograph2 - mode
	thermograph3 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star2 - direction
	Star9 - direction
	GroundStation14 - direction
	Star13 - direction
	Star0 - direction
	GroundStation7 - direction
	Star6 - direction
	GroundStation8 - direction
	Star11 - direction
	GroundStation12 - direction
	Star10 - direction
	GroundStation5 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 Star6)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star11)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation12)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star11)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation14)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star13)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument6 thermograph3)
	(supports instrument6 thermograph2)
	(supports instrument6 image1)
	(calibration_target instrument6 Star10)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation7)
	(supports instrument8 thermograph0)
	(supports instrument8 thermograph2)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 GroundStation8)
	(calibration_target instrument8 GroundStation5)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph3)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star10)
	(calibration_target instrument9 GroundStation12)
	(calibration_target instrument9 Star11)
	(calibration_target instrument9 GroundStation8)
	(supports instrument10 image1)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation5)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(pointing satellite2 Planet18)
	(pointing satellite3 Star10)
	(have_image Phenomenon15 thermograph2)
	(have_image Phenomenon16 thermograph3)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 thermograph0)
))

)

; plan
1. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 0 of 7
2. (calibrate satellite2 instrument8 groundstation5)
   added: (calibrated instrument8)
   goals met: 0 of 7
3. (turn_to satellite2 phenomenon16 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 phenomenon16)
   goals met: 0 of 7
4. (take_image satellite2 phenomenon16 instrument8 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 1 of 7
5. (turn_to satellite2 phenomenon15 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 7
6. (turn_to satellite0 groundstation3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 7
7. (take_image satellite2 phenomenon15 instrument8 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 3 of 7
8. (turn_to satellite2 phenomenon17 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon17)
   goals met: 3 of 7
9. (take_image satellite2 phenomenon17 instrument8 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 4 of 7
10. (turn_to satellite2 planet18 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 planet18)
   goals met: 5 of 7
11. (take_image satellite2 planet18 instrument8 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 6 of 7
12. (turn_to satellite3 star10 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 star10)
   goals met: 7 of 7
